# კონკატენაცია არის მონაცემთა რამდენიმე ელემენტის ერთმანეთთან შეერთების პროცესი, რათა მივიღოთ ერთიანი, დაკავშირებული მონაცემი. ყველაზე გავრცელებული მაგალითი არის სტრიქონების კონკატენაცია, როცა ტექსტის ორი ან მეტი ნაწილი ერთმანეთს ებმება და ქმნის ერთ დიდ სტრიქონს.

# მაგალითად, Python-ში შეგვიძლია სტრიქონების კონკატენაცია გავაკეთოთ + ოპერატორის გამოყენებით:

name = "ლუკა"
surname = "გელიტაშვილი"
full_name = name + " " + surname
print(full_name)

# ამ შემთხვევაში, name და surname ცვლადები ერთმანეთს უერთდება და შედეგი იქნება: "ლუკა გელიტაშვილი".

# კონკატენაცია გამოიყენება არა მხოლოდ ტექსტთან, არამედ ზოგჯერ სიებთან ერთადაც ხოლმე.