import random

print("მოგესალმებით რიცხვის გამოცნობის თამაშში!")
print("გთხოვთ, მოიფიქროთ რიცხვი 1-დან 100-მდე, ხოლო მე შევეცდები მივხვდე რა რიცხვია.")

attempts = 3

for attempt in range(attempts):

    guess = random.randint(1, 100)
    print(f"მცდელობა {attempt + 1}: ჩემი წინასწარი ვარაუდი არის {guess}")
    
    response = input("თქვენი რიცხვი არის 'მაღალი', 'დაბალი' თუ 'სწორი'? ").lower()

    if response == 'მაღალი':
        print("მნიშვნელოვნად მაღლაა! ვცდილობ ისევ...")
    elif response == 'დაბალი':
        print("მნიშვნელოვნად დაბლაა! ვცდილობ ისევ...")
    elif response == 'სწორი':
        print(f"შენ წარმოიდგინე! მე სწორად გამოვიცანი რიცხვი {guess}.")
        break
    else:
        print("შეიყვანეთ სწორი პასუხი: 'მაღალი', 'დაბალი' ან 'სწორი'.")

if response != 'სწორი':
    print("სამწუხაროდ, მე ვერ გამოვიცანი სწორი რიცხვი.")
